{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e8842bec-2002-4c1f-901f-a66006e20c32",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "c22723a9-243b-415f-b741-47bb5d843684",
   "metadata": {},
   "source": [
    "# 2.1 Градиентный алгоритм (градиентный спуск)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2f764d1c-a0f4-4016-892b-d328c835c98d",
   "metadata": {},
   "source": [
    "### Task 1\n",
    "\n",
    "Напишите программу поиска точки минимума функции:\n",
    "\n",
    "$f(x)=0.5⋅x+0.2⋅x^2−0.1⋅x^3$\n",
    "\n",
    "с помощью градиентного алгоритма:\n",
    "\n",
    "$x_n=x_{n−1} −η \\cdot \\frac {df(x)}{dx}$\n",
    "\n",
    "со следующими начальными значениями:\n",
    "\n",
    "$η=0.01$<br>\n",
    "$x_0=−4$<br>\n",
    "$N=200$ - число итераций градиентного алгоритма<br>\n",
    "\n",
    "Результат вычисления значения точки минимума $x$ сохраните в переменной **x**.\n",
    "\n",
    "P.S. На экран ничего выводить не нужно."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "63b9900d-ff18-45cb-8f3d-e0690cc333e8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-1.0758987284245605"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import numpy as np\n",
    "\n",
    "\n",
    "def func(x):\n",
    "    return 0.5 * x + 0.2 * x ** 2 - 0.1 * x ** 3\n",
    "\n",
    "\n",
    "def df(x):\n",
    "    return 0.5 + 0.4*x - 0.3*x**2 # здесь выражение производной функции f(x)\n",
    "\n",
    "\n",
    "coord_x = np.arange(-5.0, 5.0, 0.1) # значения по оси абсцисс\n",
    "coord_y = func(coord_x) # значения по оси ординат (значения функции)\n",
    "\n",
    "# здесь продолжайте программу\n",
    "N = 200\n",
    "x = -4\n",
    "lr = 0.01\n",
    "\n",
    "for _ in range(N):\n",
    "    x = x - lr * df(x)\n",
    "\n",
    "x"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "48ebfc0c-5cc5-435c-9dd9-fbfd0887ff22",
   "metadata": {},
   "source": [
    "### Task 2\n",
    "\n",
    "Дана функция:\n",
    "\n",
    "$f(x)=0.1⋅x^2−sin(x)+5$\n",
    "\n",
    "Необходимо выполнить ее аппроксимацию (восстановление) на интервале $[-5, 5]$ моделью вида:\n",
    "\n",
    "$a(x)=w_0+w_1⋅x+w_2⋅x^2+w3⋅x^3$\n",
    "\n",
    "Вектор параметров $w=[w0,w1,w2,w3]^T$ следует искать с помощью градиентного алгоритма:\n",
    "\n",
    "$w_n=w_{n−1} − η⋅ \\frac {∂Q(w)}{∂w}$\n",
    "\n",
    "где функционал качества $Q(w)$ имеет вид:\n",
    "\n",
    "$Q(w)= \\frac {1}{n} \\cdot \\sum_{i=1}^{n} (a(xi)−f(xi))^2$\n",
    "\n",
    "Его частную производную по вектору параметров $\\omega$ можно записать в векторно-матричном виде следующим образом:\n",
    "\n",
    "$ \\frac {∂Q(w)}{∂w}= \\frac {2}{n} \\cdot \\sum_{i=1}^{n} (w^T⋅x_i−f(xi))⋅x_i^T$\n",
    "\n",
    "где $x_i=[1,x,x2,x3]^T$ - вектор признаков i-го образа обучающей выборки.\n",
    "\n",
    "Продолжите программу, в которой объявлена функция f(x) с именем func, заданы значения функции по оси абсцисс и ординат, а также начальные значения и параметры для алгоритма градиентного спуска:\n",
    "\n",
    "```python\n",
    "import numpy as np\n",
    "\n",
    "# исходная функция, которую нужно аппроксимировать моделью a(x)\n",
    "def func(x):\n",
    "    return 0.1 * x**2 - np.sin(x) + 5.\n",
    "\n",
    "\n",
    "# здесь объявляйте необходимые функции\n",
    "\n",
    "\n",
    "coord_x = np.arange(-5.0, 5.0, 0.1) # значения по оси абсцисс [-5; 5] с шагом 0.1\n",
    "coord_y = func(coord_x) # значения функции по оси ординат\n",
    "\n",
    "sz = len(coord_x)\t# количество значений функций (точек)\n",
    "eta = np.array([0.1, 0.01, 0.001, 0.0001]) # шаг обучения для каждого параметра w0, w1, w2, w3\n",
    "w = np.array([0., 0., 0., 0.]) # начальные значения параметров модели\n",
    "N = 200 # число итераций градиентного алгоритма\n",
    "```\n",
    "\n",
    "Вычисленные параметры вектора ww следует сохранить в виде списка или кортежа с именем w. Также нужно вычислить значение среднего эмпирического риска для обученной модели по формуле:\n",
    "\n",
    "$Q(a,X)= \\frac {1}{n} \\cdot \\sum_{i=1}^{n} (a(x_i)−f(x_i))^2$\n",
    "\n",
    "Вычисленное значение $Q(a,X)$ сохраните в переменной Q.\n",
    "\n",
    "P.S. На экран ничего выводить не нужно."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7c48c450-6ba9-4de3-9fda-64428fe5f593",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "\n",
    "# исходная функция, которую нужно аппроксимировать моделью a(x)\n",
    "def func(x):\n",
    "    return 0.1 * x**2 - np.sin(x) + 5.\n",
    "\n",
    "\n",
    "# здесь объявляйте необходимые функции\n",
    "\n",
    "\n",
    "coord_x = np.arange(-5.0, 5.0, 0.1).reshape(-1, 1) # значения по оси абсцисс [-5; 5] с шагом 0.1\n",
    "coord_y = func(coord_x) # значения функции по оси ординат\n",
    "\n",
    "sz = len(coord_x)\t# количество значений функций (точек)\n",
    "eta = np.array([0.1, 0.01, 0.001, 0.0001]).reshape(-1, 1) # шаг обучения для каждого параметра w0, w1, w2, w3\n",
    "w = np.array([0., 0., 0., 0.]).reshape(-1, 1) # начальные значения параметров модели\n",
    "N = 200 # число итераций градиентного алгоритма\n",
    "\n",
    "# здесь продолжайте программу\n",
    "X = np.hstack((\n",
    "    np.ones_like(coord_x),\n",
    "    np.power(coord_x, np.arange(1, 4))\n",
    "))\n",
    "y = coord_y\n",
    "\n",
    "for _ in range(N):\n",
    "    gradient = 2 / sz * X.T @ (X @ w - y)\n",
    "    w = w - eta * gradient\n",
    "\n",
    "Q = np.mean((X @ w - y)**2)\n",
    "w = w.flatten().tolist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "af9303e1-7840-4a74-b7e2-1b3165d7e79a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Параметры модели: [4.986457387535088, -0.41780963958067896, 0.10273087874160171, 0.031724695628790815]\n",
      "Среднеквадратичная ошибка: 0.13061463936073706\n"
     ]
    }
   ],
   "source": [
    "print(f\"Параметры модели: {w}\")\n",
    "print(f\"Среднеквадратичная ошибка: {Q}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
